app/controllers/application_controller.rb

SELECT  `users`.* FROM `users` WHERE (id = NULL and activation_status = 'active' ) ORDER BY `users`.`id` ASC LIMIT 1
---
	def current_user
		current_user ||= User.where("id = ? and activation_status = ? ",session[:user],'active').first