app/controllers/articles_controller.rb

  def index
    @articles = Article.page(params[:page]).per(6)
---
SELECT COUNT(*) FROM `articles`
SELECT `articles`.* FROM `articles`

  def show
    @article = Article.find_by_id(params[:id])
    @comments = @article.comments.order("id desc")
---
SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
SELECT  `comments`.* FROM `comments` WHERE `comments`.`id` IS NULL LIMIT 1

  def edit
    @article = Article.find_by_id(params[:id])
---
SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1

  def update
    @article = Article.find_by_id(params[:id])
---
SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 10 LIMIT 1

  def destroy
    @article = Article.find_by_id(params[:id])
    if @article.destroy
---
SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 10 LIMIT 1
DELETE FROM `articles` WHERE `articles`.`id` = 10