app/controllers/comments_controller.rb

SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
INSERT INTO `comments` (`article_id`, `user_id`, `comment`, `status`, `created_at`, `updated_at`) VALUES (1, 1, 'wkwk', 'not active', '2019-12-10 07:39:34', '2019-12-10 07:39:34')
INSERT INTO `comments` (`article_id`, `user_id`, `comment`, `created_at`, `updated_at`) VALUES (1, 23, 'wkwk', '2019-12-10 04:16:48', '2019-12-10 04:16:48')
---
  def create
    respond_to do |format|
      @article = Article.find(params[:article_id])
      @comment = @article.comments.create(params_comment)
      if @comment.save