app/controllers/users_controller.rb

INSERT INTO `users` (`username`, `password_hash`, `email`, `created_at`, `updated_at`, `password_salt`, `activation_token`, `activation_status`) VALUES ('rejka', '$2a$12$PoVcJ3Q487Uya00mhF837.iQi5kEXqf1lnqOCBUy0.o9YZMvfiKOq', 'rejkamuhammad@gmail.com', '2019-12-09 05:15:08', '2019-12-09 05:15:08', '$2a$12$PoVcJ3Q487Uya00mhF837.', 'ley9GLHMXspPqSJs3h1aAA', 'not actived')
---
  def create
  	@user = User.new(params_user)
  	if @user.save